{
  "timestamp": "2026-01-14T22:35:00.580Z",
  "changelog": {
    "id": "manual-1768430084121",
    "title": "Manual Audit",
    "content": "\nWe've just released a major update to the Story Bible feature!\n\n## What's New\n\n- **Enhanced Character Profiles**: You can now add custom fields to character profiles, including physical descriptions, motivations, and relationships\n- **Scene Context**: Story Bible now automatically pulls in context from your current scene to provide more relevant suggestions\n- **Export Functionality**: Export your Story Bible as PDF or markdown for offline reference\n\n## Breaking Changes\n\n- The old \"Character Notes\" feature has been replaced with the new Character Profiles\n- Story Bible now requires 50 credits per generation instead of 30 credits\n\n## How to Use\n\nAccess the updated Story Bible from the sidebar. Your existing character notes will be automatically migrated to the new format.\n",
    "publishedAt": "2026-01-14T22:34:44.121Z",
    "url": null,
    "tags": []
  },
  "result": {
    "affected_articles": [
      {
        "article_title": "How many credits do features use?",
        "article_slug": "how-many-credits-do-features-use",
        "confidence": "high",
        "reason": "The changelog explicitly states that Story Bible now requires 50 credits per generation instead of 30 credits. This article discusses credit usage across features and must be updated to reflect the new Story Bible credit cost.",
        "specific_passage": "Since credit use is calculated based on a task's complexity, **different features on Sudowrite use different numbers of credits**. Simple, targeted features like Rewrite or Describe are often very credit-efficient—whereas asking Sudowrite to generate a full chapter of prose from your Scenes is complex, and will consume quite a few credits.",
        "suggested_change": "Add a specific note about Story Bible credit costs: 'Story Bible generation now requires 50 credits per generation (updated from 30 credits). This applies to generating Synopses, Characters, Worldbuilding elements, Outlines, and Scenes.'",
        "change_type": "addition"
      },
      {
        "article_title": "What is Story Bible",
        "article_slug": "what-is-story-bible",
        "confidence": "high",
        "reason": "The changelog announces major updates to the Story Bible feature including Enhanced Character Profiles with custom fields, Scene Context integration, and Export Functionality. The article needs to be updated to reflect these new capabilities.",
        "specific_passage": "Story Bible gathers the core elements of your story in one place so that you and Sudowrite's AI can reference them as you develop your work.",
        "suggested_change": "Expand the description to include: 'Story Bible now includes Enhanced Character Profiles where you can add custom fields for physical descriptions, motivations, and relationships. Scene Context automatically pulls in context from your current scene to provide more relevant suggestions. You can export your Story Bible as PDF or markdown for offline reference.'",
        "change_type": "update"
      },
      {
        "article_title": "Characters",
        "article_slug": "characters",
        "confidence": "high",
        "reason": "The changelog states that the old 'Character Notes' feature has been replaced with the new Character Profiles, and that custom fields can now be added. The article needs to reflect this breaking change and new functionality.",
        "specific_passage": "By default, each Character card created includes the following traits: Pronouns, Groups, Other Names, Personality, Background, Physical Description, and Dialogue Style.",
        "suggested_change": "Update to: 'Character cards now support Enhanced Character Profiles with customizable fields. By default, each Character card includes: Pronouns, Groups, Other Names, Personality, Background, Physical Description, and Dialogue Style. You can add custom fields to track additional information such as motivations, relationships, and other character-specific details. The old Character Notes feature has been replaced with this new Character Profiles system.'",
        "change_type": "update"
      },
      {
        "article_title": "Story Bible",
        "article_slug": "story-bible",
        "confidence": "medium",
        "reason": "The changelog mentions that Story Bible now requires 50 credits per generation. While this article is a collection page, it should be updated to note the credit cost change for users navigating Story Bible features.",
        "specific_passage": "Collection Description: Boring but necessary, you know.",
        "suggested_change": "Add a note in the collection description or as a callout: 'Note: Story Bible generation features now require 50 credits per generation (updated from 30 credits).'",
        "change_type": "addition"
      },
      {
        "article_title": "What is Story Bible",
        "article_slug": "what-is-story-bible",
        "confidence": "medium",
        "reason": "The changelog mentions that existing character notes will be automatically migrated to the new Character Profiles format. This migration detail should be documented.",
        "specific_passage": "Each project on Sudowrite has its own Story Bible, and it can be toggled on or off depending on just how you like to work.",
        "suggested_change": "Add a migration note: 'If you have existing Character Notes from previous versions, they have been automatically migrated to the new Character Profiles format.'",
        "change_type": "addition"
      },
      {
        "article_title": "Exporting Files",
        "article_slug": "exporting-files",
        "confidence": "medium",
        "reason": "The changelog mentions new Export Functionality for Story Bible (PDF or markdown). The Exporting Files article should be updated to document this new capability.",
        "specific_passage": "Neither Project Export nor Document Export include your Story Bible contents by default. Some authors choose to copy and paste those fields into a document manually in order to export them, three sections of the Story Bible each have their own Export functionalities.",
        "suggested_change": "Update to: 'You can now export your entire Story Bible as PDF or markdown for offline reference. Additionally, three sections of the Story Bible each have their own Export functionalities: Outline, Characters, and Worldbuilding.'",
        "change_type": "update"
      },
      {
        "article_title": "Scenes & Draft",
        "article_slug": "scenes-draft",
        "confidence": "medium",
        "reason": "The changelog mentions that Scene Context now automatically pulls in context from your current scene. This feature enhancement should be documented in the Scenes & Draft article.",
        "specific_passage": "**Scenes** are the building blocks of chapters in Sudowrite's Draft tool. They represent distinct moments in your story—each one typically encompassing a single location, timeframe, or character context.",
        "suggested_change": "Add: 'Scene Context automatically pulls in context from your current scene to provide more relevant suggestions when generating prose, ensuring better continuity and relevance to the specific moment in your story.'",
        "change_type": "addition"
      }
    ],
    "summary": "The Story Bible feature update introduces three major changes requiring documentation updates: (1) Enhanced Character Profiles with custom fields replacing the old Character Notes feature, (2) Scene Context integration for better context-aware suggestions, and (3) new Export Functionality for PDF/markdown export. Additionally, the credit cost for Story Bible generation has increased from 30 to 50 credits per generation. Seven articles require updates to reflect these changes, with the most critical being the Characters, What is Story Bible, and Exporting Files articles. All existing character notes have been automatically migrated to the new format."
  }
}